import 'package:flutter/material.dart';
import 'package:flutter_riverpod/flutter_riverpod.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:group_radio_button/group_radio_button.dart';
import 'package:pharmacy_online/base_widget/base_app_bar.dart';
import 'package:pharmacy_online/base_widget/base_body_widget.dart';
import 'package:pharmacy_online/base_widget/base_button.dart';
import 'package:pharmacy_online/base_widget/base_scaffold.dart';
import 'package:pharmacy_online/core/app_style.dart';
import 'package:pharmacy_online/feature/authentication/controller/authentication_controller.dart';
import 'package:pharmacy_online/feature/authentication/page/sign_up_screen.dart';
import 'package:pharmacy_online/feature/main/page/main_screen.dart';

class ConsentScreen extends ConsumerStatefulWidget {
  static const routeName = 'ConsentScreen';

  const ConsentScreen({super.key});

  @override
  _ConsentScreenState createState() => _ConsentScreenState();
}

class _ConsentScreenState extends ConsumerState<ConsentScreen> {
  String consentFirst = "ไม่ยินยอม";

  final _status = ["ไม่ยินยอม", "ยินยอม"];

  @override
  void initState() {
    WidgetsBinding.instance.addPostFrameCallback((timeStamp) {
      ref.read(authenticationControllerProvider.notifier).clearForm();
    });
    super.initState();
  }

  @override
  Widget build(BuildContext context) {
    return BaseScaffold(
      appBar: BaseAppBar(
        title: Text(
          'การยินยอมให้ใช้ข้อมูล',
          style: AppStyle.txtHeader3,
        ),
        elevation: 0.0,
        bgColor: Colors.transparent,
      ),
      bodyBuilder: (context, constrained) {
        return BaseBodyWidget(
          body: SingleChildScrollView(
            child: Column(
              children: [
                Text(
                  '''
นโยบายคุ้มครองข้อมูลส่วนบุคคล
1. นิยาม คำนิยามในนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ให้มีความหมายดังนี้
"ท่าน" หมายถึง ผู้ใช้บริการแอปพลิเคชันของเรา
"เรา" หมายถึง คณะผู้จัดทำ นักศึกษามหาวิทยาลัยพระจอมเกล้าพระนครเหนือ
"แอปพลิเคชั่น" หมายถึง แอปพลิเคชัน ซึ่งให้บริการโดยคณะผู้จัดทำ นโยบายคุ้มครองข้อมูลส่วนบุคคลนี้ใช้บังคับรวมถึงแอปพลิเคชันในส่วนที่ได้มีการเปลี่ยนแปลง ปรับปรุง อัพเดต หรือเพิ่มเติมโดยคณะผู้จัดทำ เว้นแต่แอปพลิเคชั่นที่ได้มีการเปลี่ยนแปลง ปรับปรุง อัพเดต หรือเพิ่มเติมดังกล่าวจะถูกบังคับใช้ตามเงื่อนไขและข้อตกลงต่างหากจากนโยบายคุ้มครองข้อมูลส่วนบุคคลนี้
"ข้อมูลส่วนบุคคล" หมายถึง ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม ตามกฎหมายว่ด้วยการคุ้มครองข้อมูลส่วนบุคคล

2. รายละเอียดทั่วไป
นโยบายคุ้มครองข้อมูลส่วนบุคคลนี้มีขึ้นพื่อเป็นการชี้แจงรายละเอียดและวิธีการจัดการกี่ยวกับข้อมูลส่วนบุคคลของผู้ใช้งาน โดยเราอาจดำเนินการปรับปรุงหรือแก้ไขนโยบายคุ้มครองข้อมูลส่วนบุคคลที่กำหนดดังต่อไปนี้ รวมทั้งที่ได้กำหนดไว้โดยเฉพาะเจาะจงอยู่ในส่วนใดส่วนหนึ่งของแอปพลิเคชันนี้ หากมี
ไม่ว่าบางส่วนหรือทั้งหมดเป็นครั้งคราว เพื่อให้สอดคล้องกับแนวทางการให้บริการและหลักเกณฑ์ของกฎหมายที่มีการเปลี่ยนแปลงไป ดังนั้น ท่านจึงควรติดตามนโยบายคุ้มครองข้อมูลส่วนบุคคลที่กำหนดไว้นี้อยู่เสมอ อย่างไรก็ดี เราจะเผยแพร่การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคลในแอปพลิเคชันนี้ และในกรณีที่มีการเปลี่ยนแปลงในสาระสำคัญ เราจะแจ้งให้ท่านทราบ และในกรณีที่จำเป็นตามกฎหมาย เราอาจดำเนินการขอความยินยอมเพิ่มเติมจากท่าน
อนึ่ง นโยบายคุ้มครองข้อมูลส่วนบุคคลนี้มีขึ้นพื่อบังคับใช้กับข้อมูลส่วนบุคคลที่เกี่ยวข้องกับการลงทะเบียนสมัครใช้บริการ การสมัครใช้บริการสมาชิก การใช้สินค้าและบริการ การเข้าถึงและใช้เนื้อหา ฟีเจอร์ เทคโนโลยี หรือฟังก์ชันที่ปรากฎในแอปพลิเคชั่นของเรา ทั้งที่มีอยู่ในปัจจุบันและที่เราจะได้พัฒนาหรือจัดให้มีขึ้นในอุนาคต

3. ข้อมูลส่วนบุคคลที่เก็บรวบรวม ใช้ เปิดเผย และวิธีการเก็บรวบรวมข้อมูล
ข้อมูลส่วนบุคคลที่บริษัทเก็บรวบรวมจากท่าน ได้แก่ ข้อมูลใดๆซึ่งสามารถใช้ในการระบุตัวตนของท่านได้ไม่ว่าโดยตรงหรือโดยอ้อม ดังต่อไปนี้
3.1 ข้อมูลประจำตัว ได้แก่ ชื่อ-นามสกุล เบอร์โทรศัพท์ ที่อยู่ อีเมล ที่ใช้สำหรับการยืนยันตัวตนเข้าใช้งานแอปพลิแคชัน
3.2 ข้อมูลการใช้งานแพลตฟอร์มล่าสุด ได้แก่ วันเวลาในการใช้งาน เวอร์ชันของแอปพลิเคชัน ตำแหน่งพิกัด GPSลูกค้าขณะใช้งานแอปพลิเคชัน
3.3 ข้อมูลสุขภาพของท่าน ได้แก่ น้ำหนัก ส่วนสูง ค่า BMI อุณหภูมิ ระดับความดัน ค่าระดับน้ำตาลในเลือด พฤติกรรม ประวัติการปรึกษา ประวัติการใช้ยา อาการเจ็บป่วย ประวัติการแพ้ยา โรคประจำตัว ประวัติการผ่าตัด ประวัติสุขภาพของบุคคลในครอบครัว
3.4 ข้อมูลการเงิน ได้แก่ จำนวนเงินในประวัติการซื้อและใช้งาน วันและเวลาที่ทำรายการ วิธีการชำระเงิน หลักฐานการชำระเงินโดยการโอนเงินผ่านแอปพลิเคชันธนาคาร
3.5 ข้อมูลการติดต่อสื่อสาร รวมถึง รูปแบบการติดต่อสื่อสารที่ท่านประสงค์ให้เราใช้เพื่อส่งข้อมูลการปรับปรุงแพลตฟอร์มและบริการและการสนับสนุนลูกค้า (customer support) เช่น อีเมล หรือ Facebook Messenger และหมายเลขโทรศัพท์ที่ใช้ในการติดต่อกับฝ่ายบริการลูกค้าของบริษัท
3.6 ข้อมูลความต้องการและข้อคิดเห็นของท่านต่อแพลตฟอร์มของบริษัทตลอดจนบันทึกการโต้ตอบและการสื่อสารระหว่างบริษัทกับท่าน ไม่ว่าจะในรูปแบบหรือวิธีใดๆก็ตาม เช่น โทรศัพท์ อีเมล ข้อความสนทนาและการสื่อสารบนแพลตฟอร์มหรือสื่อสังคมออนไลน์ต่างๆ ซึ่งรวมถึงข้อมูลที่ท่านให้แก่บริษัทเมื่อท่านเข้าร่วมกิจกรรมแคมเปญส่งเสริมการขาย หรือการสำรวจใดๆ ที่บริษัทเป็นผู้จัดขึ้น
3.7 ข้อมูลทางเทคนิค เช่น หมายเลขประจำเครื่องคอมพิวเตอร์ (IP Address) ซึ่งใช้ในการเชื่อมต่อคอมพิวเตอร์ของท่านกับอินเตอร์เน็ต ข้อมูลที่ใช้ในการเข้าระบบ ประเภทและเวอร์ชั่นของบราวเซอร์ที่ใช้ ข้อมูลคุกกี้ การตั้งค่าเขตเวลา ประเภทและเวอร์ชั่นของส่วนขยายในบราวเซอร์ (browser plug-in) ระบบปฏิบัติการและแพลตฟอร์ม
3.8 ข้อมูลเกี่ยวกับการเยี่ยมชมของท่าน เช่น รายการของตัวระบุทรัพยากรสากล หรือ URLs ทั้งหมดที่เชื่อมมายังแพลตฟอร์ม ผ่านแพลตฟอร์ม และจากแพลตฟอร์มของบริษัท (รวมถึงวันที่และเวลา) ผลิตภัณฑ์ที่ท่านกำลังดูหรือมองหา เวลาตอบสนองของหน้าเพจ ปัญหาการดาวน์โหลด ระยะเวลาที่เยี่ยมชมแต่ละหน้าเพจ ข้อมูลการปฏิสัมพันธ์บนหน้าเพจ (เช่น การเลื่อน การคลิ๊ก หรือการเคลื่อนที่ของเมาส์) วิธีที่ใช้ในการออกจากหน้าเพจ

4. การโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ
เราอาจส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังบุคคลหรือหน่วยงานภายนอกที่ตั้งอยู่ใน ต่างประเทศ ซึ่งอาจรวมถึงในกรณีที่พื้นที่จัดเก็บข้อมูลที่ตั้งอยู่นอกประเทศไทย หรือการใช้บริการคลาวด์ (cIoud) ซึ่งประเทศปลายทางซึ่งข้อมูลส่วนบุคคลของท่านถูกส่งหรือโอนออกไปอาจมีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลไม่เทียบท่ามาตรฐานของประเทศไทย โดยเราจะดำเนินการตามขึ้นตอนและช้มาตรการต่างๆ ตามที่เหมาะสมเพื่อให้มั่นใจว่ามีการคุ้มครองข้อมูลส่วนบุคคลที่ถูกส่งหรือโอนไปในระดับที่เพียงพอและเป็นไปตามที่กฎหมายกำหนด

5. ความมั่นคงปลอดภัยในการเก็บรักษาข้อมูลส่วนบุคคล
เราได้จัดทำและเลือกใช้ระบบการจัดก็บข้อมูลส่วนบุคคลให้มีมาตรการทางเทคนิค กายภาพและการบริหารจัดการที่เหมาะสม รวมทั้งจำกัดการเข้าถึงข้อมูลส่วนบุคคลของท่านจากพนักงาน ลูกจ้าง และตัวแทนของเราที่ไม่เกี่ยวข้อง เพื่อป้องกันไม่ให้ข้อมูลส่วนบุคคลของท่านถูกนำไปใช้ เปิดเผย ทำลาย สูญหาย เปลี่ยนแปลงแก้ไขหรือเข้าถึงโดยไม่ได้รับอนุญาต หรือโดยไม่ชอบด้วยกฎหมาย เชื่อธำรงไว้ซึ่งความลับ ความถูกต้องครบถ้วน และสภาพความพร้อมใช้งานของข้อมูลส่วนบุคคลตามข้อกำหนดขั้นต่ำที่กฎหมายกำหนด ซึ่งรวมถึงการควบคุมการเข้าถึงข้อมูลส่วนบุคคลและการใช้งานอุปกรณ์สำหรับจัดเก็บและประมวสผลข้อมูลส่วนบุคคล ที่ปลอดภัยและเหมาะสมกับการก็บรบรม ใช้ และปิดเผยข้อมูลส่วนบุคคล เรายังได้กำหนดสิทธิในการเข้าถึงข้อมูลของผู้ใช้งาน บริหารจัดการการเข้าถึงของผู้ใช้งาน เพื่อจำกัดการเข้าถึงเฉพาะผู้ที่ได้รับอนุญาตแล้ว ทั้งยังมีการกำหนดหน้าที่ความรับผิดชอบของผู้ใช้งาน เผื่อป้องกันการเข้าถึงข้อมูลส่วนบุคคลโดยไม่ได้รับอนุญาต การปิดผย การล่วงรู้ หรือการลักลอบทำสำเนาข้อมูลส่วนบุคคล หรือการลักขโมยอุปรณ์จัดเก็บหรือประมวลผลข้อมูลส่วนบุคคล นอกจากนี้ เรายังได้
วางมาตรการสำหรับการตรวจสอบย้อนหลังเกี่ยวกับการข้าถึง เปลี่ยนแปลง หรือถ่ายโอนข้อมูลส่วนบุคคลอีกด้วย อย่างไรก็ตาม เราไม่อาจรับรองได้ว่าจะไม่มีความบกพร่องหรือความผิดพลาดใด ๆ เกิดขึ้นจากการดำเนินการตามนโยบายดังกล่าว ดังนั้น เราจึงขอสงวนสิทธิ์ที่จะปฏิเสธความรับผิดในความเสียหายหรือสูญหายใด ๆ ที่เกิดขึ้นในทุกกรณี

6. การเชื่อมโยงไปยังเว็บไซต์ แอปพลิเคชัน ผลิตภัณฑ์และบริการของบุคคลภายนอก
แอปพลิเคชันของเราอาจมีลิงก์เชื่อมโยงไปยังเว็บไซต์ ผลิตภัณฑ์ แลบริการของบุคคลภายนอก ซึ่งบุคคลภายนอกเหล่านั้นอาจเก็บรวบรวมข้อมูลบางอย่างเกี่ยวกับการใช้บริการของท่าน โดยเราไม่สมารถรับผิดชอบในความปลอดภัยหรือความเป็นส่วนตัวของข้อมูลใด ๆ ของท่านที่เก็บรวบรวมโดยเว็บไซต์ แอปพลิเคชัน ผลิตภัณฑ์หรือบริการของบุคคลภายนอกดังกล่าว ท่านควรใช้ความระมัดระวังและตรวจสอบนโยบายคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์ แอปพลิเคชัน ผลิตภัณฑ์ และ บริการของบุคคลภายนอกเหล่านั้นด้วย

7. ติดต่อเรา
เราได้มอบหมายให้ Customer Support เป็นผู้ประสานงานเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลของเรา หากท่านมีข้อสงสัยหรือคำถามเกี่ยวกับนโยบายคุ้มครองข้อมูลส่วนบุคคล ท่านสามารถติดต่อ Customer Service Email : tangkwagam@gmail.com หรือ 187/53 ต.หน้าเมือง อ.เมือง จ.ราชบุรี 70000
                  ''',
                  style: AppStyle.txtBody2,
                ),
                SizedBox(
                  height: 8.h,
                ),
                RadioGroup<String>.builder(
                  groupValue: consentFirst,
                  onChanged: (value) => setState(() {
                    consentFirst = value ?? 'ไม่ยินยอม';
                  }),
                  items: _status,
                  itemBuilder: (item) => RadioButtonBuilder(
                    item,
                  ),
                ),
              ],
            ),
          ),
          bottom: BaseButton(
            isEnable: consentFirst == "ยินยอม",
            onTap: () {
              Navigator.of(context).pushNamedAndRemoveUntil(
                SignUpScreen.routeName,
                (route) => route.settings.name == MainScreen.routeName,
              );
            },
            text: 'ยืนยัน',
          ),
        );
      },
    );
  }
}
