import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:pharmacy_online/base_widget/base_app_bar.dart';
import 'package:pharmacy_online/base_widget/base_body_widget.dart';
import 'package:pharmacy_online/base_widget/base_button.dart';
import 'package:pharmacy_online/base_widget/base_scaffold.dart';
import 'package:pharmacy_online/core/app_style.dart';
import 'package:pharmacy_online/feature/authentication/page/cosent_screen.dart';

class TermAndConditionScreen extends StatelessWidget {
  static const routeName = 'TermAndConditionScreen';

  const TermAndConditionScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return BaseScaffold(
      appBar: BaseAppBar(
        title: Text(
          'ข้อตกลงและเงื่อนไข',
          style: AppStyle.txtHeader3,
        ),
        elevation: 0.0,
        bgColor: Colors.transparent,
      ),
      bodyBuilder: (context, constrained) {
        return BaseBodyWidget(
          body: SingleChildScrollView(
            child: Column(
              children: [
                Text(
                  'ข้อตกลงและเงื่อนไขในการใช้บริการแอปพลิเคชัน Pharmacy Online',
                  style: AppStyle.txtHeader3,
                ),
                SizedBox(
                  height: 8.h,
                ),
                Text(
                  '''
จากการดาวน์โหลด เรียกดู เข้าถึง หรือใช้แอปพลิเคชัน Pharmacy Online นี้ ผู้ใช้บริการตกลงที่จะผูกพันตามข้อตกลงและเงื่อนไขในการใช้งานนี้ (“ข้อตกลงและเงื่อนไขฯ“).

คณะผู้จัดทำขอสงวนสิทธิ์ในการแก้ไขข้อตกลงและเงื่อนไขฯ ได้ตลอดเวลา หากผู้ใช้บริการไม่เห็นด้วยกับข้อตกลงและเงื่อนไขฯ ข้อใดข้อหนึ่ง ผู้ใช้บริการจะต้องหยุดการเข้าถึงแอปพลิเคชัน Pharmacy Online และหยุดใช้บริการของแอปพลิเคชัน Pharmacy Online ทันที การที่ผู้ใช้บริการยังคงใช้แอปพลิเคชันซอฟต์แวร์ต่อไปจะถือเป็นการยอมรับข้อตกลงและเงื่อนไขฯ ดังกล่าว และตามที่จะมีการแก้ไขเปลี่ยนแปลงเป็นครั้งคราว

1. ข้อมูลส่วนตัวของผู้ใช้บริการถือเป็นข้อมูลที่มีความสำคัญ หากผู้ใช้บริการไม่มีความระมัดระวังหรือประมาทเลินเล่อจนเป็นสาเหตุให้มีผู้ทุจริตลักลอบนำข้อมูลส่วนตัวของผู้ใช้บริการสมัครเข้าใช้บริการ แอปพลิเคชัน Pharmacy Online และก่อให้เกิดความเสียหายกับผู้ใช้บริการแล้ว ผู้ใช้บริการตกลงรับผิดชอบในความเสียหายดังกล่าว แต่เพียงผู้เดียว

2. การสมัครใช้บริการ แอปพลิเคชัน Pharmacy Online ผู้ใช้บริการต้องใช้กับอุปกรณ์ โทรศัพท์เคลื่อนที่ หรือ Tablet ที่ผู้ให้บริการกำหนด

3. เมื่อผู้ใช้บริการแจ้งความจำนงขอสมัครใช้บริการ แอปพลิเคชัน Pharmacy Online และผู้ให้บริการพิจารณาอนุมัติให้เป็นผู้ใช้บริการดังกล่าวเรียบร้อยแล้ว ผู้ให้บริการจะให้บริการในการปรึกษาเภสัชกร ซื้อสินค้า ค้นหาสาขา ของผู้ให้บริการ

4. ข้อมูลในการสมัครและใช้บริการ แอปพลิเคชัน Pharmacy Online นี้ใช้ประโยชน์ในการใช้งาน Application นี้เท่านั้น ไม่อาจใช้อ้างอิงหรือเป็นหลักฐานประกอบการสมัครใช้บริการ หรือทำธุรกรรมใดๆ กับผู้ให้บริการ

5. การเปลี่ยนแปลงเงื่อนไขการใช้บริการ

5.1 หากเป็นการเปลี่ยนแปลงเงื่อนไขที่ส่งผลให้ผู้ใช้บริการเกิดภาระหรือความเสี่ยงที่เพิ่มขึ้น การเปลี่ยนแปลงดังกล่าวจะมีผลเมื่อผู้ใช้บริการให้ความยินยอม

5.2 หากเป็นการเปลี่ยนแปลงเงื่อนไขอื่น ผู้ใช้บริการตกลงยินยอมให้ผู้ให้บริการมีสิทธิเปลี่ยนแปลงได้ตามที่ผู้ให้บริการเห็นสมควร โดยหากเป็นการเปลี่ยนแปลงที่มีผลกระทบต่อการใช้บริการของผู้ ใช้บริการ (เช่น การปรับค่าธรรมเนียมการใช้บริการที่สอดคล้องกับต้นทุนที่เพิ่มขึ้น การเปลี่ยนแปลงช่องทางในการให้บริการ) ผู้ให้บริการจะสื่อสารหรือแจ้งข้อมูลอันเป็นสาระสำคัญของการเปลี่ยนแปลงที่ชัดเจนให้ผู้ใช้บริการทราบล่วงหน้าไม่น้อยกว่า 30 วัน หรือระยะเวลาอื่นตามที่กฎหมายกำหนด

5.3 หากมีกฎหมายและ/หรือกฎเกณฑ์กำหนดให้ผู้ให้บริการต้องดำเนินการเกี่ยวกับการเปลี่ยนแปลงเงื่อนไขไว้เป็นการเฉพาะเป็นอย่างอื่น ผู้ใช้บริการตกลงยินยอมให้ผู้ให้บริการปฏิบัติตามกฎหมายและ/หรือกฎเกณฑ์ดังกล่าวได้

6. ผู้ใช้บริการตกลงยินยอมให้ผู้ให้บริการมีสิทธิระงับ และ/หรือยกเลิกการให้บริการต่างๆ เมื่อใดก็ได้ไม่ว่าทั้งหมดหรือบางส่วน หรือเฉพาะแต่ผู้ใช้บริการรายใดรายหนึ่ง โดยผู้ให้บริการจะแจ้งให้ผู้ใช้บริการทราบล่วงหน้า เว้นแต่ ในกรณีดังต่อไปนี้ ผู้ใช้บริการตกลงว่าผู้ให้บริการมีสิทธิระงับ และ/หรือยกเลิกการให้บริการ ไม่ว่าทั้งหมดหรือบางส่วนได้ทันทีตามที่ผู้ให้บริการเห็นสมควร โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า และผู้ให้บริการไม่ต้องรับผิดชอบในความเสียหายใดๆ ที่เกิดจากการดำเนินการดังกล่าว

(1) ข้อมูล รายละเอียด คำรับรอง หรือคำยืนยันใดๆ ที่ผู้ใช้บริการให้ไว้กับผู้ให้บริการไม่เป็นความจริง ไม่ถูกต้อง หรืออาจก่อให้เกิดความเข้าใจผิดในสาระสำคัญ

(2) หากปรากฏข้อเท็จจริงที่ผู้ให้บริการเชื่อได้ว่า ข้อมูล และ/หรือรายละเอียดต่างๆ ที่ผู้ใช้บริการแจ้งแก่ผู้ให้บริการให้ดำเนินการ หรือการใช้ คณะผู้จัดทำแอปพลิเคชัน Pharmacy Online ของผู้ใช้บริการ อาจก่อให้เกิดผลกระทบในทางที่ไม่เป็นคุณเกิดขึ้น หรืออาจกระทบต่อสิทธิของผู้ให้บริการหรือบุคคลอื่น หรือมีความเสี่ยงว่าผู้ใช้บริการอาจมีวัตถุประสงค์ อันมิชอบตามกฎหมาย หรืออาจขัดต่อความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน หรือไม่ปฏิบัติตามกฎ/หลักเกณฑ์ของผู้ให้บริการหรืออาจทำให้ผู้ให้บริการปฏิบัติผิดกฎหมาย และ/หรือกฎข้อบังคับ และ/หรือคำสั่งใดๆ และ/หรือคำขอความร่วมมือใดๆ และกฎหรือคำสั่งใดๆ ของกระทรวงสาธารณสุข สภาเภสัชกรรม กระทรวงพาณิชย์ กระทรวงการคลัง และ/หรือผู้ตรวจสอบ และ/หรือหน่วยงานผู้มีอำนาจควบคุมหรือกำกับดูแลผู้ให้บริการ

(3) ผู้ให้บริการต้องปฏิบัติตามกฎหมาย ระเบียบ ข้อบังคับ หรือคำสั่งและ/หรือการขอความร่วมมือของศาล หรือผู้มีอำนาจตามกฎหมาย เช่น กระทรวงสาธารณสุข สภาเภสัชกรรม กระทรวงพาณิชย์ กระทรวงการคลัง หรือหน่วยงานที่กำกับดูแลผู้ให้บริการ

7. กรณีที่ผู้ใช้บริการชำระค่าบริการ หรือใช้บริการแล้วไม่ได้ปฏิบัติตามเงื่อนไขของผู้ให้บริการ หรือได้รับความเสียหายจากการใช้บริการ ผู้ให้บริการขอสงวนสิทธิไม่คืนค่าธรรมเนียม หรือค่าใช้จ่ายใดๆ ที่ผู้ใช้บริการได้ชำระแก่ผู้ให้บริการแล้ว และผู้ใช้บริการจะไม่เรียกร้องค่าความเสียหายใดๆ ที่เกิดขึ้น

8. ข้อมูลด้านการเงิน การบัญชี หรือข้อมูลอื่นใดในแอปพลิเคชัน Pharmacy Online ที่ผู้ให้บริการจัดส่งให้ผู้ใช้บริการผ่านทางโทรศัพท์เคลื่อนที่ หรือ Tablet ถือเป็นข้อมูลลับที่ผู้ใช้บริการไม่พึงเปิดเผยต่อบุคคลภายนอก

9. ผู้ใช้บริการตกลงและรับทราบว่า บริการต่างๆ ที่ผู้ใช้บริการได้ใช้กับผู้ให้บริการจะต้องเป็นไปตามรูปแบบ ข้อกำหนดและประกาศต่างๆ ของผู้ให้บริการเกี่ยวกับการให้บริการแต่ละประเภท ตลอดจนเอกสารใดๆ ที่เกี่ยวข้องประกอบการใช้บริการแต่ละประเภท ซึ่งถือว่า เป็นส่วนหนึ่งของข้อตกลงฯ ฉบับนี้ด้วย ดังนั้นผู้ใช้บริการตกลงและยอมรับเงื่อนไขการให้บริการแต่ละประเภท และตกลงที่จะปฏิบัติตามรูปแบบ ข้อกำหนดและประกาศต่างๆ ของผู้ให้บริการตลอดจนเอกสารใดๆ เกี่ยวกับการให้บริการในแต่ละประเภท รวมทั้งยินยอมให้ผู้ให้บริการหรือตัวแทนของผู้ให้บริการติดต่อกับผู้ใช้บริการทั้งทางโทรศัพท์ ข้อความ หรือช่องทางใดๆ

10. ผู้ใช้บริการตกลงว่า ผู้ใช้บริการจะต้องอยู่ภายใต้กฎหมาย ข้อบังคับ และหลักเกณฑ์ใดๆ ของผู้ให้บริการ เช่น กระทรวงสาธารณสุข สภาเภสัชกรรม กระทรวงพาณิชย์ กระทรวงการคลัง ศาล หน่วยงานกำกับดูแล และหน่วยงานอื่นใดที่มีอำนาจ (แล้วแต่กรณี) ทั้งที่มีอยู่ในขณะนี้และจะมีในภายหน้า (รวมเรียกว่า “กฎหมายและกฎเกณฑ์ที่เกี่ยวข้อง”)

หากมีการเปลี่ยนแปลงกฎหมายและกฎเกณฑ์ที่เกี่ยวข้อง ผู้ใช้บริการตกลงว่า ผู้ใช้บริการจะต้องปฏิบัติตามกฎหมายและกฎเกณฑ์ที่เกี่ยวข้องที่เปลี่ยนแปลงนั้นทันทีตามที่ผู้ให้บริการจะแจ้งให้ ผู้ใช้ บริการทราบ หากผู้ใช้บริการฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายและกฎเกณฑ์ที่เกี่ยวข้อง จนเป็นเหตุให้ผู้ให้บริการถูกเรียกค่าปรับ ค่าเสียหาย และ/หรือค่าใช้จ่าย ผู้ใช้บริการตกลงรับผิดชอบชดใช้ค่าปรับ ค่าเสียหาย และ/หรือค่าใช้จ่าย ดังกล่าวให้แก่ผู้ให้บริการโดยพลัน

11. การเก็บรวบรวม ใช้เปิดเผยข้อมูล

ผู้ใช้บริการตกลงยินยอมให้คณะผู้จัดทำแอปพลิเคชัน Pharmacy Onlineเก็บรวบรวมและใช้ข้อมูลของผู้ใช้บริการที่ให้ไว้แก่คณะผู้จัดทำแอปพลิเคชัน Pharmacy Online หรือเข้าถึงได้จากแหล่งอื่น โดยมีวัตถุประสงค์ที่จำเป็นเพื่อการให้บริการแก่ผู้ใช้บริการ การดำเนินการตามคำขอของผู้ใช้บริการ ก่อนให้บริการ การมอบหมายงานให้ผู้อื่นสนับสนุนการให้บริการไม่ว่าจะเกี่ยวกับงานเทคโนโลยีสารสนเทศ งานติดต่อสื่อสาร งานติดตามทวงถาม หรืองานอื่นใดก็ตาม การโอนสิทธิและ/หรือหน้าที่ การปฏิบัติตามกฎหมาย การบริหารความเสี่ยง การควบคุมกำกับตรวจสอบ การบริหารจัดการ ภายในองค์กร การจัดการข้อร้องเรียน และ/หรือ เพื่อวัตถุประสงค์อื่นใดที่จำเป็นต่อการดำเนินการของผู้ให้บริการอย่างมีนัยสำคัญ หรือเพื่อให้ผู้ให้บริการสามารถให้บริการได้สะดวก ผู้ใช้บริการตกลงยินยอมให้ผู้ให้บริการเปิดเผยข้อมูลดังกล่าวให้แก่กลุ่มธุรกิจของผู้ให้บริการ ตัวแทนของผู้ให้บริการ ผู้รับจ้างช่วงงานต่อ พันธมิตรทางธุรกิจที่ออกผลิตภัณฑ์ร่วมกัน (co-brand) ผู้ประมวลผลข้อมูล ผู้สอบบัญชี ผู้ตรวจสอบภายนอก บริษัทข้อมูลเครดิต บริษัทจัดอันดับความน่าเชื่อถือ บริษัทบริหารสินทรัพย์ ผู้สนใจจะเข้ารับโอนสิทธิผู้รับโอนสิทธิ ผู้มีอำนาจตามกฎหมาย และ/หรือหน่วยงาน/องค์กร/นิติบุคคลใดๆ ที่มีสัญญาอยู่กับผู้ให้บริการและยินยอมให้ผู้รับข้อมูลจากผู้ให้บริการดังกล่าว เก็บรวบรวม ใช้ และเปิดเผยข้อมูลดังกล่าวต่อไปได้ ภายใต้ วัตถุประสงค์ดังกล่าว และตกลงยินยอมให้ ส่ง และ/หรือ โอนข้อมูลไปเก็บไว้ บน server/cloud ในประเทศต่างๆ ที่เกี่ยวข้อง
                 ''',
                  style: AppStyle.txtBody2,
                ),
              ],
            ),
          ),
          bottom: BaseButton(
            width: MediaQuery.of(context).size.width,
            onTap: () {
              Navigator.of(context).pushNamed(
                ConsentScreen.routeName,
              );
            },
            text: 'ยืนยัน',
          ),
        );
      },
    );
  }
}


